app/controllers/games_controller.rb

INSERT INTO "games" ("status", "host_token", "settings", "created_at", "updated_at") VALUES ('lobby', '5870b33910a632d43e747f517cb178da', '{}', '2026-03-13 07:31:32.112066', '2026-03-13 07:31:32.112066') RETURNING "id"
---
  def create
    game = Game.create!

SELECT "rounds".* FROM "rounds" WHERE "rounds"."game_id" = 1 ORDER BY "rounds"."number" DESC LIMIT 1
---
  def show
    @teams = @game.teams.includes(:players)
    @round = @game.rounds.order(number: :desc).first